Revit 2026 API

# SpaceDesignHeatingLoad Property

---

Get or set the Design Heating Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DesignHeatingLoad { get; set; }
```
```vb
Public Property DesignHeatingLoad As Double
	Get
	Set
```
```cpp
public:
property double DesignHeatingLoad {
	double get ();
	void set (double value);
}
```
```fsharp
member DesignHeatingLoad : float with get, set
```

#### Property Value

Double

This property is used to get or set the Design Heating Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace